CylRAS1/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 1;

boundaryField
{

    cylinder
    {
      type              zeroGradient;
    }

    periodicity1
    {
        type            empty;
    }

    periodicity2
    {
        type            empty;
    }

    inFlow
    {
        type            zeroGradient; //inletOutlet;
        //inletValue      uniform 1;
    }

    wake2
    {
        type            waveTransmissive;
        gamma           1.4;
        fieldInf        1;
        lInf            3;
        value           uniform 1;
    }

    wake1
    {
        type            waveTransmissive;
        gamma           1.4;
        fieldInf        1;
        lInf            3;
        value           uniform 1;
    }

}





// ************************************************************************* //
